{"Wikipedia:WikiProject Portals": "/wiki/Wikipedia:WikiProject_Portals#Specific_portal_maintainers", "User:Dcljr": "/wiki/User:Dcljr", "Special:PrefixIndex/Portal:Mathematics/": "/wiki/Special:PrefixIndex/Portal:Mathematics/", "Wikipedia:CAREFUL": "/wiki/Wikipedia:CAREFUL", "Wikipedia:ASSISTED": "/wiki/Wikipedia:ASSISTED", "Wikipedia:Consensus": "/wiki/Wikipedia:Consensus", "Template:Portal maintenance status": "/wiki/Template:Portal_maintenance_status#How_to_update_the_maintenance_information_for_a_portal", "Wikipedia:Contents/Portals": "/wiki/Wikipedia:Contents/Portals", "Special:RandomInCategory/All portals": "/wiki/Special:RandomInCategory/All_portals", "Euler's Identity": "/wiki/File:Wikidata-wikiproject-mathematics.png", "Wikipedia:Shortcut": "/wiki/Wikipedia:Shortcut", "Mathematics": "/wiki/Mathematics", "Mathematical notation": "/wiki/Mathematical_notation", "Mathematical proof": "/wiki/Mathematical_proof", "Mathematical object": "/wiki/Mathematical_object", "Number": "/wiki/Number", "Point (geometry)": "/wiki/Point_(geometry)", "Euclidean space": "/wiki/Euclidean_space", "Set (mathematics)": "/wiki/Set_(mathematics)", "Mathematical structure": "/wiki/Mathematical_structure", "Game Theory": "/wiki/Game_Theory", "Natural science": "/wiki/Natural_science", "Engineering": "/wiki/Engineering", "Medicine": "/wiki/Medicine", "Social sciences": "/wiki/Social_sciences", "Applied mathematics": "/wiki/Applied_mathematics", "Statistics": "/wiki/Statistics", "Game theory": "/wiki/Game_theory", "Pure mathematics": "/wiki/Pure_mathematics", "Wikipedia:FA": "/wiki/Wikipedia:FA", "Image 1 The number π (/paɪ/; spelled out as \"pi\") is a mathematical constant that is the ratio of a circle's circumference to its diameter, approximately equal to 3.14159. The number π appears in many formulae across mathematics and physics. It is an irrational number, meaning that it cannot be expressed exactly as a ratio of two integers, although fractions such as \u007f'\"`UNIQ--postMath-00000001-QINU`\"'\u007f are commonly used to approximate it. Consequently, its decimal representation never ends, nor enters a permanently repeating pattern. It is a transcendental number, meaning that it cannot be a solution of an equation involving only sums, products, powers, and integers. The transcendence of π implies that it is impossible to solve the ancient challenge of squaring the circle with a compass and straightedge. The decimal digits of π appear to be randomly distributed, but no proof of this conjecture has been found. For thousands of years, mathematicians have attempted to extend their understanding of π, sometimes by computing its value to a high degree of accuracy. Ancient civilizations, including the Egyptians and Babylonians, required fairly accurate approximations of π for practical computations. Around 250 BC, the Greek mathematician Archimedes created an algorithm to approximate π with arbitrary accuracy. In the 5th century AD, Chinese mathematicians approximated π to seven digits, while Indian mathematicians made a five-digit approximation, both using geometrical techniques. The first computational formula for π, based on infinite series, was discovered a millennium later. The earliest known use of the Greek letter π to represent the ratio of a circle's circumference to its diameter was by the Welsh mathematician William Jones in 1706. (Full article...)": "/wiki/File:Blank.png", "Help:IPA/English": "/wiki/Help:IPA/English", "Pi": "/wiki/Pi", "Mathematical constant": "/wiki/Mathematical_constant", "Ratio": "/wiki/Ratio", "Circle": "/wiki/Circle", "Circumference": "/wiki/Circumference", "Diameter": "/wiki/Diameter", "Physics": "/wiki/Physics", "Irrational number": "/wiki/Irrational_number", "Approximations of π": "/wiki/Approximations_of_%CF%80", "Decimal representation": "/wiki/Decimal_representation", "Repeating decimal": "/wiki/Repeating_decimal", "Transcendental number": "/wiki/Transcendental_number", "Equation (mathematics)": "/wiki/Equation_(mathematics)", "Squaring the circle": "/wiki/Squaring_the_circle", "Compass-and-straightedge construction": "/wiki/Compass-and-straightedge_construction", "Random sequence": "/wiki/Random_sequence", "Egyptian mathematics": "/wiki/Egyptian_mathematics", "Babylonian mathematics": "/wiki/Babylonian_mathematics", "Greek mathematics": "/wiki/Greek_mathematics", "Archimedes": "/wiki/Archimedes", "Chinese mathematics": "/wiki/Chinese_mathematics", "Indian mathematics": "/wiki/Indian_mathematics", "Series (mathematics)": "/wiki/Series_(mathematics)", "Pi (letter)": "/wiki/Pi_(letter)", "William Jones (mathematician)": "/wiki/William_Jones_(mathematician)", "Image 2 The repeating decimal continues infinitely In mathematics, 0.999... (also written as 0.9 or 0..9) denotes the repeating decimal consisting of an unending sequence of 9s after the decimal point. This repeating decimal represents the smallest number no less than every decimal number in the sequence (0.9, 0.99, 0.999, ...); that is, the supremum of this sequence. This number is equal to 1. In other words, \"0.999...\" is not \"almost exactly\" or \"very, very nearly but not quite\" 1  –  rather, \"0.999...\" and \"1\" represent exactly the same number. There are many ways of showing this equality, from intuitive arguments to mathematically rigorous proofs. The technique used depends on the target audience, background assumptions, historical context, and preferred development of the real numbers, the system within which 0.999... is commonly defined. In other systems, 0.999... can have the same meaning, a different definition, or be undefined. (Full article...)": "/wiki/File:Blank.png", "Enlarge": "/wiki/File:999_Perspective.svg", "0.999...": "/wiki/0.999...", "Decimal point": "/wiki/Decimal_point", "Decimal number": "/wiki/Decimal_number", "Supremum": "/wiki/Supremum", "Mathematical rigor": "/wiki/Mathematical_rigor", "Real number": "/wiki/Real_number", "Image 3 Richard Phillips Feynman (/ˈfaɪnmən/; May 11, 1918 – February 15, 1988) was an American theoretical physicist, known for his work in the path integral formulation of quantum mechanics, the theory of quantum electrodynamics, the physics of the superfluidity of supercooled liquid helium, as well as his work in particle physics for which he proposed the parton model. For his contributions to the development of quantum electrodynamics, Feynman received the Nobel Prize in Physics in 1965 jointly with Julian Schwinger and Shin'ichirō Tomonaga. Feynman developed a widely used pictorial representation scheme for the mathematical expressions describing the behavior of subatomic particles, which later became known as Feynman diagrams. During his lifetime, Feynman became one of the best-known scientists in the world. In a 1999 poll of 130 leading physicists worldwide by the British journal Physics World, he was ranked the seventh-greatest physicist of all time. (Full article...)": "/wiki/File:Blank.png", "Richard Feynman": "/wiki/Richard_Feynman", "Theoretical physicist": "/wiki/Theoretical_physicist", "Path integral formulation": "/wiki/Path_integral_formulation", "Quantum mechanics": "/wiki/Quantum_mechanics", "Quantum electrodynamics": "/wiki/Quantum_electrodynamics", "Superfluidity": "/wiki/Superfluidity", "Liquid helium": "/wiki/Liquid_helium", "Particle physics": "/wiki/Particle_physics", "Parton model": "/wiki/Parton_model", "Nobel Prize in Physics": "/wiki/Nobel_Prize_in_Physics", "Julian Schwinger": "/wiki/Julian_Schwinger", "Shin'ichirō Tomonaga": "/wiki/Shin%27ichir%C5%8D_Tomonaga", "Subatomic particle": "/wiki/Subatomic_particle", "Feynman diagram": "/wiki/Feynman_diagram", "Physics World": "/wiki/Physics_World", "Image 4 The manipulations of the Rubik's Cube form the Rubik's Cube group. In mathematics, a group is a non-empty set and an operation that combines any two elements of the set to produce a third element of the set, in such a way that the operation is associative, an identity element exists and every element has an inverse. These three axioms hold for number systems and many other mathematical structures. For example, the integers together with the addition operation form a group. The concept of a group and the axioms that define it were elaborated for handling, in a unified way, essential structural properties of very different mathematical entities such as numbers, geometric shapes and polynomial roots. Because the concept of groups is ubiquitous in numerous areas both within and outside mathematics, some authors consider it as a central organizing principle of contemporary mathematics. In geometry groups arise naturally in the study of symmetries and geometric transformations: The symmetries of an object form a group, called the symmetry group of the object, and the transformations of a given type form a general group. Lie groups appear in symmetry groups in geometry, and also in the Standard Model of particle physics. The Poincaré group is a Lie group consisting of the symmetries of spacetime in special relativity. Point groups describe symmetry in molecular chemistry. (Full article...)": "/wiki/File:Blank.png", "Rubik's Cube": "/wiki/Rubik%27s_Cube", "Rubik's Cube group": "/wiki/Rubik%27s_Cube_group", "Group (mathematics)": "/wiki/Group_(mathematics)", "Binary operation": "/wiki/Binary_operation", "Element (mathematics)": "/wiki/Element_(mathematics)", "Associative property": "/wiki/Associative_property", "Identity element": "/wiki/Identity_element", "Inverse element": "/wiki/Inverse_element", "Axiom": "/wiki/Axiom", "Integer": "/wiki/Integer", "Geometric shape": "/wiki/Geometric_shape", "Polynomial root": "/wiki/Polynomial_root", "Geometry": "/wiki/Geometry", "Symmetries": "/wiki/Symmetries", "Geometric transformation": "/wiki/Geometric_transformation", "Symmetry group": "/wiki/Symmetry_group", "Lie group": "/wiki/Lie_group", "Standard Model": "/wiki/Standard_Model", "Poincaré group": "/wiki/Poincar%C3%A9_group", "Spacetime": "/wiki/Spacetime", "Special relativity": "/wiki/Special_relativity", "Point group": "/wiki/Point_group", "Molecular symmetry": "/wiki/Molecular_symmetry", "Image 5 The first 15,000 partial sums of 0 + 1 − 2 + 3 − 4 + ... The graph is situated with positive integers to the right and negative integers to the left. In mathematics, 1 − 2 + 3 − 4 + ··· is an infinite series whose terms are the successive positive integers, given alternating signs. Using sigma summation notation the sum of the first m terms of the series can be expressed as \u007f'\"`UNIQ--postMath-00000002-QINU`\"'\u007f The infinite series diverges, meaning that its sequence of partial sums, (1, −1, 2, −2, 3, ...), does not tend towards any finite limit. Nonetheless, in the mid-18th century, Leonhard Euler wrote what he admitted to be a paradoxical equation: \u007f'\"`UNIQ--postMath-00000003-QINU`\"'\u007f (Full article...)": "/wiki/File:Blank.png", "1 − 2 + 3 − 4 + ⋯": "/wiki/1_%E2%88%92_2_%2B_3_%E2%88%92_4_%2B_%E2%8B%AF", "Positive integer": "/wiki/Positive_integer", "Alternating series": "/wiki/Alternating_series", "Summation": "/wiki/Summation", "Divergent series": "/wiki/Divergent_series", "Partial sum": "/wiki/Partial_sum", "Limit of a sequence": "/wiki/Limit_of_a_sequence", "Leonhard Euler": "/wiki/Leonhard_Euler", "List of paradoxes": "/wiki/List_of_paradoxes#Mathematics", "Image 6 Rejewski, c. 1932 Marian Adam Rejewski (Polish: [ˈmarjan rɛˈjɛfskʲi] (listen); 16 August 1905 – 13 February 1980) was a Polish mathematician and cryptologist who in late 1932 reconstructed the sight-unseen Nazi German military Enigma cipher machine, aided by limited documents obtained by French military intelligence. Over the next nearly seven years, Rejewski and fellow mathematician-cryptologists Jerzy Różycki and Henryk Zygalski developed and used techniques and equipment to decrypt the German machine ciphers, even as the Germans introduced modifications to their equipment and encryption procedures. Five weeks before the outbreak of World War II in Europe, the Poles shared their technological achievements with the French and British at a conference in Warsaw, thus enabling Britain to begin reading German Enigma-encrypted messages, seven years after Rejewski's original reconstruction of the machine. The intelligence that was gained by the British from Enigma decrypts formed part of what was code-named Ultra and contributed—perhaps decisively—to the defeat of Nazi Germany. In 1929, while studying mathematics at Poznań University, Rejewski attended a secret cryptology course conducted by the Polish General Staff's Cipher Bureau (Biuro Szyfrów), which he joined in September 1932. The Bureau had had no success in reading Enigma-enciphered messages and set Rejewski to work on the problem in late 1932; he deduced the machine's secret internal wiring after only a few weeks. Rejewski and his two colleagues then developed successive techniques for the regular decryption of Enigma messages. His own contributions included the cryptologic card catalog, derived using the cyclometer that he had invented, and the cryptologic bomb. (Full article...)": "/wiki/File:Blank.png", "Marian Rejewski": "/wiki/Marian_Rejewski", "Help:IPA/Polish": "/wiki/Help:IPA/Polish", "About this sound": "/wiki/File:Pl-Marian_Rejewski-2.ogg", "Pl-Marian Rejewski-2.ogg": "//upload.wikimedia.org/wikipedia/commons/0/0c/Pl-Marian_Rejewski-2.ogg", "Polish people": "/wiki/Polish_people", "Mathematician": "/wiki/Mathematician", "Cryptography": "/wiki/Cryptography", "Enigma machine": "/wiki/Enigma_machine", "French secret service": "/wiki/French_secret_service", "Jerzy Różycki": "/wiki/Jerzy_R%C3%B3%C5%BCycki", "Henryk Zygalski": "/wiki/Henryk_Zygalski", "European theatre of World War II": "/wiki/European_theatre_of_World_War_II", "Ultra (cryptography)": "/wiki/Ultra_(cryptography)", "End of World War II in Europe": "/wiki/End_of_World_War_II_in_Europe", "Adam Mickiewicz University in Poznań": "/wiki/Adam_Mickiewicz_University_in_Pozna%C5%84", "Polish General Staff": "/wiki/Polish_General_Staff", "Biuro Szyfrów": "/wiki/Biuro_Szyfr%C3%B3w", "Card catalog (cryptology)": "/wiki/Card_catalog_(cryptology)", "Cyclometer": "/wiki/Cyclometer", "Bomba (cryptography)": "/wiki/Bomba_(cryptography)", "Image 7 Portrait by Jakob Emanuel Handmann, 1753 Leonhard Euler (/ˈɔɪlər/ OY-lər, German: [ˈɔʏlɐ] (listen); 15 April 1707 – 18 September 1783) was a Swiss mathematician, physicist, astronomer, geographer, logician and engineer who founded the studies of graph theory and topology and made pioneering and influential discoveries in many other branches of mathematics such as analytic number theory, complex analysis, and infinitesimal calculus. He introduced much of modern mathematical terminology and notation, including the notion of a mathematical function. He is also known for his work in mechanics, fluid dynamics, optics, astronomy and music theory. Euler is held to be one of the greatest mathematicians in history and the greatest of the 18th century. Several great mathematicians who produced their work after Euler's death have recognised his importance in the field as shown by quotes attributed to many of them: Pierre-Simon Laplace expresses Euler's influence on mathematics: \"Read Euler, read Euler, he is the master of us all.\" Carl Friedrich Gauss wrote: \"The study of Euler's works will remain the best school for the different fields of mathematics, and nothing else can replace it.\" Euler is also widely considered to be the most prolific; his 866 publications as well as his correspondences are collected in the Opera Omnia Leonhard Euler which, when completed, will consist of 81 quarto volumes. He spent most of his adult life in Saint Petersburg, Russia, and in Berlin, then the capital of Prussia. (Full article...)": "/wiki/File:Blank.png", "Jakob Emanuel Handmann": "/wiki/Jakob_Emanuel_Handmann", "Help:Pronunciation respelling key": "/wiki/Help:Pronunciation_respelling_key", "Help:IPA/Standard German": "/wiki/Help:IPA/Standard_German", "De-Euler.ogg": "//upload.wikimedia.org/wikipedia/commons/c/c2/De-Euler.ogg", "Physicist": "/wiki/Physicist", "Astronomer": "/wiki/Astronomer", "Geographer": "/wiki/Geographer", "Logician": "/wiki/Logician", "Graph theory": "/wiki/Graph_theory", "Topology": "/wiki/Topology", "Analytic number theory": "/wiki/Analytic_number_theory", "Complex analysis": "/wiki/Complex_analysis", "Infinitesimal calculus": "/wiki/Infinitesimal_calculus", "Function (mathematics)": "/wiki/Function_(mathematics)", "Mechanics": "/wiki/Mechanics", "Fluid dynamics": "/wiki/Fluid_dynamics", "Optics": "/wiki/Optics", "Astronomy": "/wiki/Astronomy", "Music theory": "/wiki/Music_theory", "Pierre-Simon Laplace": "/wiki/Pierre-Simon_Laplace", "Carl Friedrich Gauss": "/wiki/Carl_Friedrich_Gauss", "Opera Omnia Leonhard Euler": "/wiki/Opera_Omnia_Leonhard_Euler", "Quarto": "/wiki/Quarto", "Saint Petersburg": "/wiki/Saint_Petersburg", "Russian Empire": "/wiki/Russian_Empire", "Berlin": "/wiki/Berlin", "Kingdom of Prussia": "/wiki/Kingdom_of_Prussia", "Image 8 One of Molyneux's celestial globes, which is displayed in Middle Temple Library – from the frontispiece of the Hakluyt Society's 1889 reprint of A Learned Treatise of Globes, both Cœlestiall and Terrestriall, one of the English editions of Robert Hues' Latin work Tractatus de Globis (1594) Emery Molyneux (/ˈɛməri ˈmɒlɪnoʊ/ EM-ər-ee MOL-in-oh; died June 1598) was an English Elizabethan maker of globes, mathematical instruments and ordnance. His terrestrial and celestial globes, first published in 1592, were the first to be made in England and the first to be made by an Englishman. Molyneux was known as a mathematician and maker of mathematical instruments such as compasses and hourglasses. He became acquainted with many prominent men of the day, including the writer Richard Hakluyt and the mathematicians Robert Hues and Edward Wright. He also knew the explorers Thomas Cavendish, Francis Drake, Walter Raleigh and John Davis. Davis probably introduced Molyneux to his own patron, the London merchant William Sanderson, who largely financed the construction of the globes. When completed, the globes were presented to Elizabeth I. Larger globes were acquired by royalty, noblemen and academic institutions, while smaller ones were purchased as practical navigation aids for sailors and students. The globes were the first to be made in such a way that they were unaffected by the humidity at sea, and they came into general use on ships. (Full article...)": "/wiki/File:Blank.png", "Middle Temple": "/wiki/Middle_Temple", "Hakluyt Society": "/wiki/Hakluyt_Society", "Latin": "/wiki/Latin", "Emery Molyneux": "/wiki/Emery_Molyneux", "English people": "/wiki/English_people", "Elizabethan era": "/wiki/Elizabethan_era", "Globe": "/wiki/Globe", "Mathematical instruments": "/wiki/Mathematical_instruments", "Weapon": "/wiki/Weapon", "Compass": "/wiki/Compass", "Hourglass": "/wiki/Hourglass", "Richard Hakluyt": "/wiki/Richard_Hakluyt", "Robert Hues": "/wiki/Robert_Hues", "Edward Wright (mathematician)": "/wiki/Edward_Wright_(mathematician)", "Thomas Cavendish": "/wiki/Thomas_Cavendish", "Francis Drake": "/wiki/Francis_Drake", "Walter Raleigh": "/wiki/Walter_Raleigh", "John Davis (English explorer)": "/wiki/John_Davis_(English_explorer)", "Elizabeth I of England": "/wiki/Elizabeth_I_of_England", "Image 9 Cantor, c. 1910 Georg Ferdinand Ludwig Philipp Cantor (/ˈkæntɔːr/ KAN-tor, German: [ˈɡeːɔʁk ˈfɛʁdinant ˈluːtvɪç ˈfiːlɪp ˈkantɔʁ]; March 3 [O.S. February 19] 1845 – January 6, 1918) was a mathematician. He played a pivotal role in the creation of set theory, which has become a fundamental theory in mathematics. Cantor established the importance of one-to-one correspondence between the members of two sets, defined infinite and well-ordered sets, and proved that the real numbers are more numerous than the natural numbers. Cantor's method of proof of this theorem implies the existence of an infinity of infinities. He defined the cardinal and ordinal numbers and their arithmetic. Cantor's work is of great philosophical interest, a fact he was well aware of. Originally, Cantor's theory of transfinite numbers was regarded as counter-intuitive – even shocking. This caused it to encounter resistance from mathematical contemporaries such as Leopold Kronecker and Henri Poincaré and later from Hermann Weyl and L. E. J. Brouwer, while Ludwig Wittgenstein raised philosophical objections; see Controversy over Cantor's theory. Cantor, a devout Lutheran Christian, believed the theory had been communicated to him by God. Some Christian theologians (particularly neo-Scholastics) saw Cantor's work as a challenge to the uniqueness of the absolute infinity in the nature of God – on one occasion equating the theory of transfinite numbers with pantheism – a proposition that Cantor vigorously rejected. Not all theologians were against Cantor's theory; prominent neo-scholastic philosopher Constantin Gutberlet was in favor of it and Cardinal Johann Baptist Franzelin accepted it as a valid theory (after Cantor made some important clarifications). (Full article...)": "/wiki/File:Blank.png", "Georg Cantor": "/wiki/Georg_Cantor", "Old Style and New Style dates": "/wiki/Old_Style_and_New_Style_dates", "Set theory": "/wiki/Set_theory", "Foundations of mathematics": "/wiki/Foundations_of_mathematics", "One-to-one correspondence": "/wiki/One-to-one_correspondence", "Infinite set": "/wiki/Infinite_set", "Well-order": "/wiki/Well-order", "Natural number": "/wiki/Natural_number", "Infinity": "/wiki/Infinity", "Cardinal number": "/wiki/Cardinal_number", "Ordinal number": "/wiki/Ordinal_number", "Transfinite number": "/wiki/Transfinite_number", "Leopold Kronecker": "/wiki/Leopold_Kronecker", "Henri Poincaré": "/wiki/Henri_Poincar%C3%A9", "Hermann Weyl": "/wiki/Hermann_Weyl", "L. E. J. Brouwer": "/wiki/L._E._J._Brouwer", "Ludwig Wittgenstein": "/wiki/Ludwig_Wittgenstein", "Philosophical objections to Cantor's theory": "/wiki/Philosophical_objections_to_Cantor%27s_theory", "Controversy over Cantor's theory": "/wiki/Controversy_over_Cantor%27s_theory", "Lutheran Christian": "/wiki/Lutheran_Christian", "Christian theology": "/wiki/Christian_theology", "Neo-Scholasticism": "/wiki/Neo-Scholasticism", "Pantheism": "/wiki/Pantheism", "Johann Baptist Franzelin": "/wiki/Johann_Baptist_Franzelin", "Image 10 General relativity, also known as the general theory of relativity and Einstein's theory of gravity, is the geometric theory of gravitation published by Albert Einstein in 1915 and is the current description of gravitation in modern physics. General relativity generalizes special relativity and refines Newton's law of universal gravitation, providing a unified description of gravity as a geometric property of space and time or four-dimensional spacetime. In particular, the curvature of spacetime is directly related to the energy and momentum of whatever matter and radiation are present. The relation is specified by the Einstein field equations, a system of second order partial differential equations. Newton's law of universal gravitation, which describes classical gravity, can be seen as a prediction of general relativity for the almost flat spacetime geometry around stationary mass distributions. Some predictions of general relativity, however, are beyond Newton's law of universal gravitation in classical physics. These predictions concern the passage of time, the geometry of space, the motion of bodies in free fall, and the propagation of light, and include gravitational time dilation, gravitational lensing, the gravitational redshift of light, the Shapiro time delay and singularities/black holes. So far, all tests of general relativity have been shown to be in agreement with the theory. The time dependent solutions of general relativity enable us to talk about the history of the universe and have provided the modern framework for cosmology, thus leading to the discovery of the Big Bang and cosmic microwave background radiation. Despite the introduction of a number of alternative theories, general relativity continues to be the simplest theory consistent with experimental data. (Full article...)": "/wiki/File:Blank.png", "General relativity": "/wiki/General_relativity", "Differential geometry": "/wiki/Differential_geometry", "Scientific theory": "/wiki/Scientific_theory", "Gravitation": "/wiki/Gravitation", "Albert Einstein": "/wiki/Albert_Einstein", "Modern physics": "/wiki/Modern_physics", "Theory of relativity": "/wiki/Theory_of_relativity", "Newton's law of universal gravitation": "/wiki/Newton%27s_law_of_universal_gravitation", "Space": "/wiki/Space", "Time in physics": "/wiki/Time_in_physics", "Four-dimensional space": "/wiki/Four-dimensional_space", "Curvature": "/wiki/Curvature", "Energy": "/wiki/Energy", "Momentum": "/wiki/Momentum", "Matter": "/wiki/Matter", "Radiation": "/wiki/Radiation", "Einstein field equations": "/wiki/Einstein_field_equations", "Partial differential equation": "/wiki/Partial_differential_equation", "Classical physics": "/wiki/Classical_physics", "Free fall": "/wiki/Free_fall", "Gravitational time dilation": "/wiki/Gravitational_time_dilation", "Gravitational lens": "/wiki/Gravitational_lens", "Gravitational redshift": "/wiki/Gravitational_redshift", "Shapiro time delay": "/wiki/Shapiro_time_delay", "Gravitational singularity": "/wiki/Gravitational_singularity", "Black holes": "/wiki/Black_holes", "Tests of general relativity": "/wiki/Tests_of_general_relativity", "Cosmology": "/wiki/Cosmology", "Big Bang": "/wiki/Big_Bang", "Cosmic microwave background": "/wiki/Cosmic_microwave_background", "Alternatives to general relativity": "/wiki/Alternatives_to_general_relativity", "Experimental data": "/wiki/Experimental_data", "Image 11 High-precision test of general relativity by the Cassini space probe (artist's impression): radio signals sent between the Earth and the probe (green wave) are delayed by the warping of spacetime (blue lines) due to the Sun's mass. General relativity is a theory of gravitation developed by Albert Einstein between 1907 and 1915. The theory of general relativity says that the observed gravitational effect between masses results from their warping of spacetime. By the beginning of the 20th century, Newton's law of universal gravitation had been accepted for more than two hundred years as a valid description of the gravitational force between masses. In Newton's model, gravity is the result of an attractive force between massive objects. Although even Newton was troubled by the unknown nature of that force, the basic framework was extremely successful at describing motion. (Full article...)": "/wiki/File:Blank.png", "Cassini-Huygens": "/wiki/Cassini-Huygens", "Shapiro effect": "/wiki/Shapiro_effect", "Sun": "/wiki/Sun", "Introduction to general relativity": "/wiki/Introduction_to_general_relativity", "Image 12 Amalie Emmy Noether (US: /ˈnʌtər/, UK: /ˈnɜːtə/; German: [ˈnøːtɐ]; 23 March 1882 – 14 April 1935) was a German mathematician who made many important contributions to abstract algebra. She discovered Noether's First and Second Theorem, which are fundamental in mathematical physics. She was described by Pavel Alexandrov, Albert Einstein, Jean Dieudonné, Hermann Weyl and Norbert Wiener as the most important woman in the history of mathematics. As one of the leading mathematicians of her time, she developed some theories of rings, fields, and algebras. In physics, Noether's theorem explains the connection between symmetry and conservation laws. Noether was born to a Jewish family in the Franconian town of Erlangen; her father was the mathematician Max Noether. She originally planned to teach French and English after passing the required examinations, but instead studied mathematics at the University of Erlangen, where her father lectured. After completing her doctorate in 1907 under the supervision of Paul Gordan, she worked at the Mathematical Institute of Erlangen without pay for seven years. At the time, women were largely excluded from academic positions. In 1915, she was invited by David Hilbert and Felix Klein to join the mathematics department at the University of Göttingen, a world-renowned center of mathematical research. The philosophical faculty objected, however, and she spent four years lecturing under Hilbert's name. Her habilitation was approved in 1919, allowing her to obtain the rank of Privatdozent. (Full article...)": "/wiki/File:Blank.png", "Emmy Noether": "/wiki/Emmy_Noether", "American English": "/wiki/American_English", "British English": "/wiki/British_English", "Germans": "/wiki/Germans", "Abstract algebra": "/wiki/Abstract_algebra", "Noether's theorem": "/wiki/Noether%27s_theorem", "Noether's second theorem": "/wiki/Noether%27s_second_theorem", "Mathematical physics": "/wiki/Mathematical_physics", "Pavel Alexandrov": "/wiki/Pavel_Alexandrov", "Jean Dieudonné": "/wiki/Jean_Dieudonn%C3%A9", "Norbert Wiener": "/wiki/Norbert_Wiener", "List of women in mathematics": "/wiki/List_of_women_in_mathematics", "Ring (mathematics)": "/wiki/Ring_(mathematics)", "Field (mathematics)": "/wiki/Field_(mathematics)", "Algebra over a field": "/wiki/Algebra_over_a_field", "Symmetry in physics": "/wiki/Symmetry_in_physics", "Conservation law (physics)": "/wiki/Conservation_law_(physics)", "Jewish family": "/wiki/Jewish_family", "Franconia": "/wiki/Franconia", "Erlangen": "/wiki/Erlangen", "Max Noether": "/wiki/Max_Noether", "University of Erlangen": "/wiki/University_of_Erlangen", "Paul Gordan": "/wiki/Paul_Gordan", "David Hilbert": "/wiki/David_Hilbert", "Felix Klein": "/wiki/Felix_Klein", "University of Göttingen": "/wiki/University_of_G%C3%B6ttingen", "Habilitation": "/wiki/Habilitation", "Privatdozent": "/wiki/Privatdozent", "Image 13 The title page of a 1634 version of Hues' Tractatus de globis in the collection of the Biblioteca Nacional de Portugal Robert Hues (1553 – 24 May 1632) was an English mathematician and geographer. He attended St. Mary Hall at Oxford, and graduated in 1578. Hues became interested in geography and mathematics, and studied navigation at a school set up by Walter Raleigh. During a trip to Newfoundland, he made observations which caused him to doubt the accepted published values for variations of the compass. Between 1586 and 1588, Hues travelled with Thomas Cavendish on a circumnavigation of the globe, performing astronomical observations and taking the latitudes of places they visited. Beginning in August 1591, Hues and Cavendish again set out on another circumnavigation of the globe. During the voyage, Hues made astronomical observations in the South Atlantic, and continued his observations of the variation of the compass at various latitudes and at the Equator. Cavendish died on the journey in 1592, and Hues returned to England the following year. In 1594, Hues published his discoveries in the Latin work Tractatus de globis et eorum usu (Treatise on Globes and Their Use) which was written to explain the use of the terrestrial and celestial globes that had been made and published by Emery Molyneux in late 1592 or early 1593, and to encourage English sailors to use practical astronomical navigation. Hues' work subsequently went into at least 12 other printings in Dutch, English, French and Latin. (Full article...)": "/wiki/File:Blank.png", "Biblioteca Nacional de Portugal": "/wiki/Biblioteca_Nacional_de_Portugal", "St Mary Hall, Oxford": "/wiki/St_Mary_Hall,_Oxford", "Oxford University": "/wiki/Oxford_University", "Geography": "/wiki/Geography", "Navigation": "/wiki/Navigation", "Newfoundland (island)": "/wiki/Newfoundland_(island)", "Magnetic declination": "/wiki/Magnetic_declination", "Circumnavigation": "/wiki/Circumnavigation", "Astronomical": "/wiki/Astronomical", "Latitudes": "/wiki/Latitudes", "Equator": "/wiki/Equator", "Image 14 Title page of the first edition of Wright's Certaine Errors in Navigation (1599) Edward Wright (baptised 8 October 1561; died November 1615) was an English mathematician and cartographer noted for his book Certaine Errors in Navigation (1599; 2nd ed., 1610), which for the first time explained the mathematical basis of the Mercator projection by building on the works of Pedro Nunes, and set out a reference table giving the linear scale multiplication factor as a function of latitude, calculated for each minute of arc up to a latitude of 75°. This was in fact a table of values of the integral of the secant function, and was the essential step needed to make practical both the making and the navigational use of Mercator charts. Wright was born at Garveston in Norfolk and educated at Gonville and Caius College, Cambridge, where he became a fellow from 1587 to 1596. In 1589 the college granted him leave after Elizabeth I requested that he carry out navigational studies with a raiding expedition organised by the Earl of Cumberland to the Azores to capture Spanish galleons. The expedition's route was the subject of the first map to be prepared according to Wright's projection, which was published in Certaine Errors in 1599. The same year, Wright created and published the first world map produced in England and the first to use the Mercator projection since Gerardus Mercator's original 1569 map. (Full article...)": "/wiki/File:Blank.png", "Baptism": "/wiki/Baptism", "Cartographer": "/wiki/Cartographer", "Mercator projection": "/wiki/Mercator_projection", "Pedro Nunes": "/wiki/Pedro_Nunes", "Latitude": "/wiki/Latitude", "Minute of arc": "/wiki/Minute_of_arc", "Integral of the secant function": "/wiki/Integral_of_the_secant_function", "Garvestone": "/wiki/Garvestone", "Norfolk": "/wiki/Norfolk", "Gonville and Caius College, Cambridge": "/wiki/Gonville_and_Caius_College,_Cambridge", "Oxford fellow": "/wiki/Oxford_fellow", "Azores Voyage of 1589": "/wiki/Azores_Voyage_of_1589", "George Clifford, 3rd Earl of Cumberland": "/wiki/George_Clifford,_3rd_Earl_of_Cumberland", "Azores": "/wiki/Azores", "Galleon": "/wiki/Galleon", "Gerardus Mercator": "/wiki/Gerardus_Mercator", "Image 15 Émile Michel Hyacinthe Lemoine (French: [emil ləmwan]; 22 November 1840 – 21 February 1912) was a French civil engineer and a mathematician, a geometer in particular. He was educated at a variety of institutions, including the Prytanée National Militaire and, most notably, the École Polytechnique. Lemoine taught as a private tutor for a short period after his graduation from the latter school. Lemoine is best known for his proof of the existence of the Lemoine point (or the symmedian point) of a triangle. Other mathematical work includes a system he called Géométrographie and a method which related algebraic expressions to geometric objects. He has been called a co-founder of modern triangle geometry, as many of its characteristics are present in his work. (Full article...)": "/wiki/File:Blank.png", "Émile Lemoine": "/wiki/%C3%89mile_Lemoine", "Help:IPA/French": "/wiki/Help:IPA/French", "Civil engineer": "/wiki/Civil_engineer", "Geometer": "/wiki/Geometer", "Prytanée National Militaire": "/wiki/Prytan%C3%A9e_National_Militaire", "École Polytechnique": "/wiki/%C3%89cole_Polytechnique", "Lemoine point": "/wiki/Lemoine_point", "Triangle": "/wiki/Triangle", "Algebra": "/wiki/Algebra", "Wikipedia:WikiProject Mathematics/Recognized content": "/wiki/Wikipedia:WikiProject_Mathematics/Recognized_content#Featured_articles", "a smooth surface, vaguely conical in shape and embedded in a basket-like mesh of points, rotates in empty space": "/wiki/File:NURBS_3-D_surface.gif", "Non-uniform rational B-spline": "/wiki/Non-uniform_rational_B-spline", "User:Greg L": "/wiki/User:Greg_L", "Computer graphics": "/wiki/Computer_graphics", "Surface (mathematics)": "/wiki/Surface_(mathematics)", "Formula": "/wiki/Formula", "3D modeling": "/wiki/3D_modeling", "Pierre Bézier": "/wiki/Pierre_B%C3%A9zier", "Paul de Casteljau": "/wiki/Paul_de_Casteljau", "B-spline": "/wiki/B-spline", "Bézier curve": "/wiki/B%C3%A9zier_curve", "Conic section": "/wiki/Conic_section", "Sphere": "/wiki/Sphere", "Computer-aided design": "/wiki/Computer-aided_design", "Computer-aided manufacturing": "/wiki/Computer-aided_manufacturing", "Computer-aided engineering": "/wiki/Computer-aided_engineering", "T-spline": "/wiki/T-spline", "Subdivision surface": "/wiki/Subdivision_surface", "Portal:Mathematics/picture": "/wiki/Portal:Mathematics/picture", "Wikipedia:GA": "/wiki/Wikipedia:GA", "Image 1 James Clerk Maxwell FRSE FRS (13 June 1831 – 5 November 1879) was a Scottish mathematician and scientist responsible for the classical theory of electromagnetic radiation, which was the first theory to describe electricity, magnetism and light as different manifestations of the same phenomenon. Maxwell's equations for electromagnetism have been called the \"second great unification in physics\" where the first one had been realised by Isaac Newton. With the publication of \"A Dynamical Theory of the Electromagnetic Field\" in 1865, Maxwell demonstrated that electric and magnetic fields travel through space as waves moving at the speed of light. He proposed that light is an undulation in the same medium that is the cause of electric and magnetic phenomena. The unification of light and electrical phenomena led to his prediction of the existence of radio waves. Maxwell is also regarded as a founder of the modern field of electrical engineering. (Full article...)": "/wiki/File:Blank.png", "James Clerk Maxwell": "/wiki/James_Clerk_Maxwell", "Fellow of the Royal Society of Edinburgh": "/wiki/Fellow_of_the_Royal_Society_of_Edinburgh", "Fellow of the Royal Society": "/wiki/Fellow_of_the_Royal_Society", "Classical theory": "/wiki/Classical_theory", "Electromagnetic radiation": "/wiki/Electromagnetic_radiation", "Magnetism": "/wiki/Magnetism", "Maxwell's equations": "/wiki/Maxwell%27s_equations", "Unification (physics)": "/wiki/Unification_(physics)#Unification_of_magnetism,_electricity,_light_and_related_radiation", "Isaac Newton": "/wiki/Isaac_Newton", "A Dynamical Theory of the Electromagnetic Field": "/wiki/A_Dynamical_Theory_of_the_Electromagnetic_Field", "Electric force": "/wiki/Electric_force", "Magnetic field": "/wiki/Magnetic_field", "Wave": "/wiki/Wave", "Speed of light": "/wiki/Speed_of_light", "Radio wave": "/wiki/Radio_wave", "Electrical engineering": "/wiki/Electrical_engineering", "Image 2 Paterson's worms are a family of cellular automata devised in 1971 by Mike Paterson and John Horton Conway to model the behaviour and feeding patterns of certain prehistoric worms. In the model, a worm moves between points on a triangular grid along line segments, representing food. Its turnings are determined by the configuration of eaten and uneaten line segments adjacent to the point at which the worm currently is. Despite being governed by simple rules the behaviour of the worms can be extremely complex, and the ultimate fate of one variant is still unknown. The worms were studied in the early 1970s by Paterson, Conway and Michael Beeler, described by Beeler in June 1973, and presented in November 1973 in Martin Gardner's \"Mathematical Games\" column in Scientific American. (Full article...)": "/wiki/File:Blank.png", "Paterson's worms": "/wiki/Paterson%27s_worms", "Cellular automaton": "/wiki/Cellular_automaton", "Mike Paterson": "/wiki/Mike_Paterson", "John Horton Conway": "/wiki/John_Horton_Conway", "Martin Gardner": "/wiki/Martin_Gardner", "Scientific American": "/wiki/Scientific_American", "Image 3 Stanisław Marcin Ulam ([sta'ɲiswaf 'mart͡ɕin 'ulam]; 13 April 1909 – 13 May 1984) was a Polish scientist in the fields of mathematics and nuclear physics. He participated in the Manhattan Project, originated the Teller–Ulam design of thermonuclear weapons, discovered the concept of the cellular automaton, invented the Monte Carlo method of computation, and suggested nuclear pulse propulsion. In pure and applied mathematics, he proved some theorems and proposed several conjectures. Born into a wealthy Polish Jewish family, Ulam studied mathematics at the Lwów Polytechnic Institute, where he earned his PhD in 1933 under the supervision of Kazimierz Kuratowski and Włodzimierz Stożek. In 1935, John von Neumann, whom Ulam had met in Warsaw, invited him to come to the Institute for Advanced Study in Princeton, New Jersey, for a few months. From 1936 to 1939, he spent summers in Poland and academic years at Harvard University in Cambridge, Massachusetts, where he worked to establish important results regarding ergodic theory. On 20 August 1939, he sailed for the United States for the last time with his 17-year-old brother Adam Ulam. He became an assistant professor at the University of Wisconsin–Madison in 1940, and a United States citizen in 1941. (Full article...)": "/wiki/File:Blank.png", "Stanislaw Ulam": "/wiki/Stanislaw_Ulam", "Manhattan Project": "/wiki/Manhattan_Project", "History of the Teller–Ulam design": "/wiki/History_of_the_Teller%E2%80%93Ulam_design", "Thermonuclear weapon": "/wiki/Thermonuclear_weapon", "Monte Carlo method": "/wiki/Monte_Carlo_method", "Nuclear pulse propulsion": "/wiki/Nuclear_pulse_propulsion", "Polish Jewish": "/wiki/Polish_Jewish", "Lviv Polytechnic": "/wiki/Lviv_Polytechnic#Second_Polish_Republic", "PhD": "/wiki/PhD", "Kazimierz Kuratowski": "/wiki/Kazimierz_Kuratowski", "Włodzimierz Stożek": "/wiki/W%C5%82odzimierz_Sto%C5%BCek", "John von Neumann": "/wiki/John_von_Neumann", "Institute for Advanced Study": "/wiki/Institute_for_Advanced_Study", "Princeton, New Jersey": "/wiki/Princeton,_New_Jersey", "Harvard University": "/wiki/Harvard_University", "Cambridge, Massachusetts": "/wiki/Cambridge,_Massachusetts", "Ergodic theory": "/wiki/Ergodic_theory", "Adam Ulam": "/wiki/Adam_Ulam", "University of Wisconsin–Madison": "/wiki/University_of_Wisconsin%E2%80%93Madison", "Image 4 The red graph is the dual graph of the blue graph, and vice versa. In the mathematical discipline of graph theory, the dual graph of a plane graph G is a graph that has a vertex for each face of G. The dual graph has an edge for each pair of faces in G that are separated from each other by an edge, and a self-loop when the same face appears on both sides of an edge. Thus, each edge e of G has a corresponding dual edge, whose endpoints are the dual vertices corresponding to the faces on either side of e. The definition of the dual depends on the choice of embedding of the graph G, so it is a property of plane graphs (graphs that are already embedded in the plane) rather than planar graphs (graphs that may be embedded but for which the embedding is not yet known). For planar graphs generally, there may be multiple dual graphs, depending on the choice of planar embedding of the graph. Historically, the first form of graph duality to be recognized was the association of the Platonic solids into pairs of dual polyhedra. Graph duality is a topological generalization of the geometric concepts of dual polyhedra and dual tessellations, and is in turn generalized combinatorially by the concept of a dual matroid. Variations of planar graph duality include a version of duality for directed graphs, and duality for graphs embedded onto non-planar two-dimensional surfaces. (Full article...)": "/wiki/File:Blank.png", "Dual graph": "/wiki/Dual_graph", "Plane graph": "/wiki/Plane_graph", "Vertex (graph theory)": "/wiki/Vertex_(graph_theory)", "Face (graph theory)": "/wiki/Face_(graph_theory)", "Edge (graph theory)": "/wiki/Edge_(graph_theory)", "Self-loop": "/wiki/Self-loop", "Planar graph": "/wiki/Planar_graph", "Duality (mathematics)": "/wiki/Duality_(mathematics)", "Platonic solid": "/wiki/Platonic_solid", "Dual polyhedron": "/wiki/Dual_polyhedron", "Dual tessellation": "/wiki/Dual_tessellation", "Dual matroid": "/wiki/Dual_matroid", "Directed graph": "/wiki/Directed_graph", "Image 5 A homomorphism from the flower snark J5 into the cycle graph C5. It is also a retraction onto the subgraph on the central five vertices. Thus J5 is in fact homo­mor­phi­cally equivalent to the core C5. In the mathematical field of graph theory, a graph homomorphism is a mapping between two graphs that respects their structure. More concretely, it is a function between the vertex sets of two graphs that maps adjacent vertices to adjacent vertices. Homomorphisms generalize various notions of graph colorings and allow the expression of an important class of constraint satisfaction problems, such as certain scheduling or frequency assignment problems. The fact that homomorphisms can be composed leads to rich algebraic structures: a preorder on graphs, a distributive lattice, and a category (one for undirected graphs and one for directed graphs). The computational complexity of finding a homomorphism between given graphs is prohibitive in general, but a lot is known about special cases that are solvable in polynomial time. Boundaries between tractable and intractable cases have been an active area of research. (Full article...)": "/wiki/File:Blank.png", "Flower snark": "/wiki/Flower_snark", "Core (graph theory)": "/wiki/Core_(graph_theory)", "Graph homomorphism": "/wiki/Graph_homomorphism", "Graph (discrete mathematics)": "/wiki/Graph_(discrete_mathematics)", "Graph coloring": "/wiki/Graph_coloring", "Constraint satisfaction problem": "/wiki/Constraint_satisfaction_problem", "Scheduling (production processes)": "/wiki/Scheduling_(production_processes)", "Frequency assignment": "/wiki/Frequency_assignment", "Preorder": "/wiki/Preorder", "Distributive lattice": "/wiki/Distributive_lattice", "Category (mathematics)": "/wiki/Category_(mathematics)", "Computational complexity": "/wiki/Computational_complexity", "Time complexity": "/wiki/Time_complexity#Polynomial_time", "Image 6 A Halin graph In graph theory, a Halin graph is a type of planar graph, constructed by connecting the leaves of a tree into a cycle. The tree must have at least four vertices, none of which has exactly two neighbors; it should be drawn in the plane so none of its edges cross (this is called a planar embedding), and the cycle connects the leaves in their clockwise ordering in this embedding. Thus, the cycle forms the outer face of the Halin graph, with the tree inside it. Halin graphs are named after German mathematician Rudolf Halin, who studied them in 1971. The cubic Halin graphs – the ones in which each vertex touches exactly three edges – had already been studied over a century earlier by Kirkman. Halin graphs are polyhedral graphs, meaning that every Halin graph can be used to form the vertices and edges of a convex polyhedron, and the polyhedra formed from them have been called roofless polyhedra or domes. (Full article...)": "/wiki/File:Blank.png", "Halin graph": "/wiki/Halin_graph", "Tree (graph theory)": "/wiki/Tree_(graph_theory)", "Euclidean plane": "/wiki/Euclidean_plane", "Planar embedding": "/wiki/Planar_embedding", "Rudolf Halin": "/wiki/Rudolf_Halin", "Cubic graph": "/wiki/Cubic_graph", "Thomas Kirkman": "/wiki/Thomas_Kirkman", "Polyhedral graph": "/wiki/Polyhedral_graph", "Convex polyhedron": "/wiki/Convex_polyhedron", "Image 7 The boundary of a Reuleaux triangle is a constant width curve based on an equilateral triangle. All points on a side are equidistant from the opposite vertex. A Reuleaux triangle [ʁœlo] is a curved triangle with constant width, the simplest and best known curve of constant width other than the circle. It is formed from the intersection of three circular disks, each having its center on the boundary of the other two. Constant width means that the separation of every two parallel supporting lines is the same, independent of their orientation. Because its width is constant, the Reuleaux triangle is one answer to the question \"Other than a circle, what shape can a manhole cover be made so that it cannot fall down through the hole?\" Reuleaux triangles have also been called spherical triangles, but that term more properly refers to triangles on the curved surface of a sphere. They are named after Franz Reuleaux, a 19th-century German engineer who pioneered the study of machines for translating one type of motion into another, and who used Reuleaux triangles in his designs. However, these shapes were known before his time, for instance by the designers of Gothic church windows, by Leonardo da Vinci, who used it for a map projection, and by Leonhard Euler in his study of constant-width shapes. Other applications of the Reuleaux triangle include giving the shape to guitar picks, fire hydrant nuts, pencils, and drill bits for drilling filleted square holes, as well as in graphic design in the shapes of some signs and corporate logos. (Full article...)": "/wiki/File:Blank.png", "Reuleaux triangle": "/wiki/Reuleaux_triangle", "Circular triangle": "/wiki/Circular_triangle", "Curve of constant width": "/wiki/Curve_of_constant_width", "Supporting line": "/wiki/Supporting_line", "Manhole cover": "/wiki/Manhole_cover", "Franz Reuleaux": "/wiki/Franz_Reuleaux", "Gothic architecture": "/wiki/Gothic_architecture", "Leonardo da Vinci": "/wiki/Leonardo_da_Vinci", "Octant projection": "/wiki/Octant_projection", "Guitar pick": "/wiki/Guitar_pick", "Fire hydrant": "/wiki/Fire_hydrant", "Pencil": "/wiki/Pencil", "Drill bit": "/wiki/Drill_bit", "Fillet (mechanics)": "/wiki/Fillet_(mechanics)", "Image 8 \"The Gherkin\", 30 St Mary Axe, London, completed 2003, is a parametrically designed solid of revolution. Mathematics and architecture are related, since, as with other arts, architects use mathematics for several reasons. Apart from the mathematics needed when engineering buildings, architects use geometry: to define the spatial form of a building; from the Pythagoreans of the sixth century BC onwards, to create forms considered harmonious, and thus to lay out buildings and their surroundings according to mathematical, aesthetic and sometimes religious principles; to decorate buildings with mathematical objects such as tessellations; and to meet environmental goals, such as to minimise wind speeds around the bases of tall buildings. In ancient Egypt, ancient Greece, India, and the Islamic world, buildings including pyramids, temples, mosques, palaces and mausoleums were laid out with specific proportions for religious reasons. In Islamic architecture, geometric shapes and geometric tiling patterns are used to decorate buildings, both inside and outside. Some Hindu temples have a fractal-like structure where parts resemble the whole, conveying a message about the infinite in Hindu cosmology. In Chinese architecture, the tulou of Fujian province are circular, communal defensive structures. In the twenty-first century, mathematical ornamentation is again being used to cover public buildings. (Full article...)": "/wiki/File:Blank.png", "30 St Mary Axe": "/wiki/30_St_Mary_Axe", "Parametric design": "/wiki/Parametric_design", "Solid of revolution": "/wiki/Solid_of_revolution", "Mathematics and architecture": "/wiki/Mathematics_and_architecture", "Mathematics and art": "/wiki/Mathematics_and_art", "Architect": "/wiki/Architect", "Building": "/wiki/Building", "Pythagoreanism": "/wiki/Pythagoreanism", "Aesthetic": "/wiki/Aesthetic", "Tessellation": "/wiki/Tessellation", "Ancient Egyptian architecture": "/wiki/Ancient_Egyptian_architecture", "Ancient Greek architecture": "/wiki/Ancient_Greek_architecture", "Architecture of India": "/wiki/Architecture_of_India", "Islamic architecture": "/wiki/Islamic_architecture", "Egyptian pyramids": "/wiki/Egyptian_pyramids", "Mausoleum": "/wiki/Mausoleum", "Islamic geometric patterns": "/wiki/Islamic_geometric_patterns", "Fractal": "/wiki/Fractal", "Hindu cosmology": "/wiki/Hindu_cosmology", "Chinese architecture": "/wiki/Chinese_architecture", "Tulou": "/wiki/Tulou", "Fujian province": "/wiki/Fujian_province", "Image 9 The maximum spacing method tries to find a distribution function such that the spacings, D(i), are all approximately of the same length. This is done by maximizing their geometric mean. In statistics, maximum spacing estimation (MSE or MSP), or maximum product of spacing estimation (MPS), is a method for estimating the parameters of a univariate statistical model. The method requires maximization of the geometric mean of spacings in the data, which are the differences between the values of the cumulative distribution function at neighbouring data points. The concept underlying the method is based on the probability integral transform, in that a set of independent random samples derived from any random variable should on average be uniformly distributed with respect to the cumulative distribution function of the random variable. The MPS method chooses the parameter values that make the observed data as uniform as possible, according to a specific quantitative measure of uniformity. (Full article...)": "/wiki/File:Blank.png", "Geometric mean": "/wiki/Geometric_mean", "Maximum spacing estimation": "/wiki/Maximum_spacing_estimation", "Parametric model": "/wiki/Parametric_model", "Cumulative distribution function": "/wiki/Cumulative_distribution_function", "Probability integral transform": "/wiki/Probability_integral_transform", "Image 10 The state of a vibrating string can be modeled as a point in a Hilbert space. The decomposition of a vibrating string into its vibrations in distinct overtones is given by the projection of the point onto the coordinate axes in the space. In mathematics, Hilbert spaces (named after David Hilbert) allow generalizing the methods of linear algebra and calculus from (finite-dimensional) Euclidean vector spaces to spaces that may be infinite-dimensional. Hilbert spaces arise naturally and frequently in mathematics and physics, typically as function spaces. Formally, a Hilbert space is a vector space equipped with an inner product that defines a distance function for which the space is a complete metric space. The earliest Hilbert spaces were studied from this point of view in the first decade of the 20th century by David Hilbert, Erhard Schmidt, and Frigyes Riesz. They are indispensable tools in the theories of partial differential equations, quantum mechanics, Fourier analysis (which includes applications to signal processing and heat transfer), and ergodic theory (which forms the mathematical underpinning of thermodynamics). John von Neumann coined the term Hilbert space for the abstract concept that underlies many of these diverse applications. The success of Hilbert space methods ushered in a very fruitful era for functional analysis. Apart from the classical Euclidean vector spaces, examples of Hilbert spaces include spaces of square-integrable functions, spaces of sequences, Sobolev spaces consisting of generalized functions, and Hardy spaces of holomorphic functions. (Full article...)": "/wiki/File:Blank.png", "Vibrating string": "/wiki/Vibrating_string", "Overtone": "/wiki/Overtone", "Hilbert space": "/wiki/Hilbert_space", "Linear algebra": "/wiki/Linear_algebra", "Calculus": "/wiki/Calculus", "Euclidean vector space": "/wiki/Euclidean_vector_space", "Infinite-dimensional": "/wiki/Infinite-dimensional", "Function space": "/wiki/Function_space", "Vector space": "/wiki/Vector_space", "Inner product": "/wiki/Inner_product", "Distance function": "/wiki/Distance_function", "Complete metric space": "/wiki/Complete_metric_space", "Erhard Schmidt": "/wiki/Erhard_Schmidt", "Frigyes Riesz": "/wiki/Frigyes_Riesz", "Mathematical formulation of quantum mechanics": "/wiki/Mathematical_formulation_of_quantum_mechanics", "Fourier analysis": "/wiki/Fourier_analysis", "Signal processing": "/wiki/Signal_processing", "Thermodynamics": "/wiki/Thermodynamics", "Functional analysis": "/wiki/Functional_analysis", "Square-integrable function": "/wiki/Square-integrable_function", "Sequence space": "/wiki/Sequence_space", "Sobolev space": "/wiki/Sobolev_space", "Generalized function": "/wiki/Generalized_function", "Hardy space": "/wiki/Hardy_space", "Holomorphic function": "/wiki/Holomorphic_function", "Image 11 Srinivasa Ramanujan FRS (/ˈsriːnɪvɑːsə rɑːˈmɑːnʊdʒən/; born Srinivasa Ramanujan Aiyangar, IPA: [sriːniʋaːsa ɾaːmaːnud͡ʑan ajːaŋgar]; 22 December 1887 – 26 April 1920) was an Indian mathematician. Though he had almost no formal training in pure mathematics, he made substantial contributions to mathematical analysis, number theory, infinite series, and continued fractions, including solutions to mathematical problems then considered unsolvable. Ramanujan initially developed his own mathematical research in isolation. According to Hans Eysenck, \"he tried to interest the leading professional mathematicians in his work, but failed for the most part. What he had to show them was too novel, too unfamiliar, and additionally presented in unusual ways; they could not be bothered\". Seeking mathematicians who could better understand his work, in 1913 he began a postal correspondence with the English mathematician G. H. Hardy at the University of Cambridge, England. Recognising Ramanujan's work as extraordinary, Hardy arranged for him to travel to Cambridge. In his notes, Hardy commented that Ramanujan had produced groundbreaking new theorems, including some that \"defeated me completely; I had never seen anything in the least like them before\", and some recently proven but highly advanced results. (Full article...)": "/wiki/File:Blank.png", "Srinivasa Ramanujan": "/wiki/Srinivasa_Ramanujan", "Help:IPA/Tamil": "/wiki/Help:IPA/Tamil", "Mathematical analysis": "/wiki/Mathematical_analysis", "Number theory": "/wiki/Number_theory", "Infinite series": "/wiki/Infinite_series", "Continued fraction": "/wiki/Continued_fraction", "Hans Eysenck": "/wiki/Hans_Eysenck", "Postal service": "/wiki/Postal_service", "G. H. Hardy": "/wiki/G._H._Hardy", "University of Cambridge": "/wiki/University_of_Cambridge", "Theorem": "/wiki/Theorem", "Image 12 Measuring the width of a Reuleaux triangle as the distance between parallel supporting lines. Because this distance does not depend on the direction of the lines, the Reuleaux triangle is a curve of constant width. In geometry, a curve of constant width is a simple closed curve in the plane whose width (the distance between parallel supporting lines) is the same in all directions. The shape bounded by a curve of constant width is a body of constant width or an orbiform, the name given to these shapes by Leonhard Euler. Standard examples are the circle and the Reuleaux triangle. These curves can also be constructed using circular arcs centered at crossings of an arrangement of lines, as the involutes of certain curves, or by intersecting circles centered on a partial curve. Every body of constant width is a convex set, its boundary crossed at most twice by any line, and if the line crosses perpendicularly it does so at both crossings, separated by the width. By Barbier's theorem, the body's perimeter is exactly π times its width, but its area depends on its shape, with the Reuleaux triangle having the smallest possible area for its width and the circle the largest. Every superset of a body of constant width includes pairs of points that are farther apart than the width, and every curve of constant width includes at least six points of extreme curvature. Although the Reuleaux triangle is not smooth, curves of constant width can always be approximated arbitrarily closely by smooth curves of the same constant width. (Full article...)": "/wiki/File:Blank.png", "Simple closed curve": "/wiki/Simple_closed_curve", "Plane (geometry)": "/wiki/Plane_(geometry)", "Arrangement of lines": "/wiki/Arrangement_of_lines", "Involute": "/wiki/Involute", "Convex set": "/wiki/Convex_set", "Barbier's theorem": "/wiki/Barbier%27s_theorem", "Luis Caffarelli": "/wiki/Luis_Caffarelli", "Abel Prize": "/wiki/Abel_Prize", "Monge–Ampère equation": "/wiki/Monge%E2%80%93Amp%C3%A8re_equation", "Affine symmetric group": "/wiki/Affine_symmetric_group", "Schwarz lantern": "/wiki/Schwarz_lantern", "Surface area": "/wiki/Surface_area", "Ari Nagel": "/wiki/Ari_Nagel", "Subgroup distortion": "/wiki/Subgroup_distortion", "Mikhael Gromov (mathematician)": "/wiki/Mikhael_Gromov_(mathematician)", "François Viète": "/wiki/Fran%C3%A7ois_Vi%C3%A8te", "Viète's formula": "/wiki/Vi%C3%A8te%27s_formula", "A Passage North": "/wiki/A_Passage_North", "2021 Booker Prize": "/wiki/2021_Booker_Prize", "Sri Lankan Civil War": "/wiki/Sri_Lankan_Civil_War", "The Polymath": "/wiki/The_Polymath", "Martin Kemp (art historian)": "/wiki/Martin_Kemp_(art_historian)", "Ruth Stokes": "/wiki/Ruth_Stokes", "Linear programming": "/wiki/Linear_programming", "Duke University": "/wiki/Duke_University", "Did you know...": "/wiki/File:Nuvola_apps_filetypes.svg", "Catalan number": "/wiki/Catalan_number", "Combinatorics": "/wiki/Combinatorics", "Ball (mathematics)": "/wiki/Ball_(mathematics)", "Banach-Tarski paradox": "/wiki/Banach-Tarski_paradox", "Quintic equation": "/wiki/Quintic_equation", "Euler": "/wiki/Euler", "Amicable number": "/wiki/Amicable_number", "Knot theory": "/wiki/Knot_theory", "Millennium Prize problems": "/wiki/Millennium_Prize_problems", "Portal:Mathematics/Did you know": "/wiki/Portal:Mathematics/Did_you_know", "Continuum hypothesis": "/wiki/Continuum_hypothesis", "Hypothesis": "/wiki/Hypothesis", "Aleph number": "/wiki/Aleph_number", "Cardinality of the real numbers": "/wiki/Cardinality_of_the_real_numbers", "Real line": "/wiki/Real_line", "Portal:Mathematics/Selected article archive": "/wiki/Portal:Mathematics/Selected_article_archive", "Category:Algebra": "/wiki/Category:Algebra", "Category:Arithmetic": "/wiki/Category:Arithmetic", "Category:Mathematical analysis": "/wiki/Category:Mathematical_analysis", "Category:Complex analysis": "/wiki/Category:Complex_analysis", "Category:Applied mathematics": "/wiki/Category:Applied_mathematics", "Category:Calculus": "/wiki/Category:Calculus", "Category:Category theory": "/wiki/Category:Category_theory", "Category:Chaos theory": "/wiki/Category:Chaos_theory", "Category:Combinatorics": "/wiki/Category:Combinatorics", "Category:Dynamical systems": "/wiki/Category:Dynamical_systems", "Category:Fractals": "/wiki/Category:Fractals", "Category:Game theory": "/wiki/Category:Game_theory", "Category:Geometry": "/wiki/Category:Geometry", "Category:Algebraic geometry": "/wiki/Category:Algebraic_geometry", "Category:Graph theory": "/wiki/Category:Graph_theory", "Category:Group theory": "/wiki/Category:Group_theory", "Category:Linear algebra": "/wiki/Category:Linear_algebra", "Category:Mathematical logic": "/wiki/Category:Mathematical_logic", "Category:Model theory": "/wiki/Category:Model_theory", "Category:Multi-dimensional geometry": "/wiki/Category:Multi-dimensional_geometry", "Category:Number theory": "/wiki/Category:Number_theory", "Category:Numerical analysis": "/wiki/Category:Numerical_analysis", "Category:Mathematical optimization": "/wiki/Category:Mathematical_optimization", "Category:Order theory": "/wiki/Category:Order_theory", "Category:Probability and statistics": "/wiki/Category:Probability_and_statistics", "Category:Set theory": "/wiki/Category:Set_theory", "Category:Statistics": "/wiki/Category:Statistics", "Category:Topology": "/wiki/Category:Topology", "Category:Algebraic topology": "/wiki/Category:Algebraic_topology", "Category:Trigonometry": "/wiki/Category:Trigonometry", "Category:Linear programming": "/wiki/Category:Linear_programming", "Category:Mathematics": "/wiki/Category:Mathematics", "Category:History of mathematics": "/wiki/Category:History_of_mathematics", "Category:Mathematicians": "/wiki/Category:Mathematicians", "Category:Mathematics awards": "/wiki/Category:Mathematics_awards", "Category:Mathematics education": "/wiki/Category:Mathematics_education", "Category:Mathematics literature": "/wiki/Category:Mathematics_literature", "Category:Mathematical notation": "/wiki/Category:Mathematical_notation", "Category:Mathematics organizations": "/wiki/Category:Mathematics_organizations", "Category:Mathematical theorems": "/wiki/Category:Mathematical_theorems", "Category:Mathematical proofs": "/wiki/Category:Mathematical_proofs", "Category:Unsolved problems in mathematics": "/wiki/Category:Unsolved_problems_in_mathematics", "Category:Mathematics by country": "/wiki/Category:Mathematics_by_country", "Category:Fields of mathematics": "/wiki/Category:Fields_of_mathematics", "Category:Mathematics-related lists": "/wiki/Category:Mathematics-related_lists", "Category:Works about mathematics": "/wiki/Category:Works_about_mathematics", "Category:Mathematics and art": "/wiki/Category:Mathematics_and_art", "Category:Mathematical classification systems": "/wiki/Category:Mathematical_classification_systems", "Category:Mathematical concepts": "/wiki/Category:Mathematical_concepts", "Category:Mathematical constants": "/wiki/Category:Mathematical_constants", "Category:Mathematics and culture": "/wiki/Category:Mathematics_and_culture", "Category:Mathematical examples": "/wiki/Category:Mathematical_examples", "Category:Mathematical science occupations": "/wiki/Category:Mathematical_science_occupations", "Category:Outlines of mathematics and logic": "/wiki/Category:Outlines_of_mathematics_and_logic", "Category:Philosophy of mathematics": "/wiki/Category:Philosophy_of_mathematics", "Category:Mathematical projects": "/wiki/Category:Mathematical_projects", "Category:Pseudomathematics": "/wiki/Category:Pseudomathematics", "Category:Set index articles on mathematics": "/wiki/Category:Set_index_articles_on_mathematics", "Category:Mathematical terminology": "/wiki/Category:Mathematical_terminology", "Category:Mathematical tools": "/wiki/Category:Mathematical_tools", "Category:Mathematics stubs": "/wiki/Category:Mathematics_stubs", "Areas of mathematics": "/wiki/Areas_of_mathematics", "History of mathematics": "/wiki/History_of_mathematics", "Philosophy of mathematics": "/wiki/Philosophy_of_mathematics", "Mathematical beauty": "/wiki/Mathematical_beauty", "Mathematics education": "/wiki/Mathematics_education", "Outline of mathematics": "/wiki/Outline_of_mathematics", "Glossary of mathematical symbols": "/wiki/Glossary_of_mathematical_symbols", "Mathematical logic": "/wiki/Mathematical_logic", "Proof theory": "/wiki/Proof_theory", "Gödel's incompleteness theorems": "/wiki/G%C3%B6del%27s_incompleteness_theorems", "Model theory": "/wiki/Model_theory", "Recursion theory": "/wiki/Recursion_theory", "Naive set theory": "/wiki/Naive_set_theory", "Axiomatic set theory": "/wiki/Axiomatic_set_theory", "Category theory": "/wiki/Category_theory", "Topos theory": "/wiki/Topos_theory", "Algebraic number theory": "/wiki/Algebraic_number_theory", "Arithmetic": "/wiki/Arithmetic", "Fundamental theorem of arithmetic": "/wiki/Fundamental_theorem_of_arithmetic", "Prime number": "/wiki/Prime_number", "Rational number": "/wiki/Rational_number", "Algebraic number": "/wiki/Algebraic_number", "Discrete mathematics": "/wiki/Discrete_mathematics", "Combinatorial geometry": "/wiki/Combinatorial_geometry", "Coding theory": "/wiki/Coding_theory", "Combinatorial design": "/wiki/Combinatorial_design", "Enumerative combinatorics": "/wiki/Enumerative_combinatorics", "Combinatorial optimization": "/wiki/Combinatorial_optimization", "Order theory": "/wiki/Order_theory", "Lattice theory": "/wiki/Lattice_theory", "Digital Signal Processing": "/wiki/Digital_Signal_Processing", "Theoretical computer science": "/wiki/Theoretical_computer_science", "Computability theory (computation)": "/wiki/Computability_theory_(computation)", "Computational complexity theory": "/wiki/Computational_complexity_theory", "Elementary algebra": "/wiki/Elementary_algebra", "Group theory": "/wiki/Group_theory", "Ring theory": "/wiki/Ring_theory", "Field theory (mathematics)": "/wiki/Field_theory_(mathematics)", "Commutative algebra": "/wiki/Commutative_algebra", "Geometric algebra": "/wiki/Geometric_algebra", "Matrix (mathematics)": "/wiki/Matrix_(mathematics)", "Multilinear algebra": "/wiki/Multilinear_algebra", "Universal algebra": "/wiki/Universal_algebra", "Fundamental theorem of algebra": "/wiki/Fundamental_theorem_of_algebra", "Source": "/wiki/File:Nuvola_apps_kmplot.svg", "Fundamental theorem of calculus": "/wiki/Fundamental_theorem_of_calculus", "Vector calculus": "/wiki/Vector_calculus", "Geometric calculus": "/wiki/Geometric_calculus", "Measure theory": "/wiki/Measure_theory", "Real analysis": "/wiki/Real_analysis", "Differential equations": "/wiki/Differential_equations", "Ordinary differential equation": "/wiki/Ordinary_differential_equation", "Integral equation": "/wiki/Integral_equation", "Approximation theory": "/wiki/Approximation_theory", "Special functions": "/wiki/Special_functions", "Potential theory": "/wiki/Potential_theory", "Harmonic analysis": "/wiki/Harmonic_analysis", "Operator theory": "/wiki/Operator_theory", "Euclidean geometry": "/wiki/Euclidean_geometry", "Trigonometry": "/wiki/Trigonometry", "Analytic geometry": "/wiki/Analytic_geometry", "Non-Euclidean geometry": "/wiki/Non-Euclidean_geometry", "Affine geometry": "/wiki/Affine_geometry", "Projective geometry": "/wiki/Projective_geometry", "Convex geometry": "/wiki/Convex_geometry", "Discrete geometry": "/wiki/Discrete_geometry", "Algebraic geometry": "/wiki/Algebraic_geometry", "K theory": "/wiki/K_theory", "Gauge theory (mathematics)": "/wiki/Gauge_theory_(mathematics)", "Riemannian geometry": "/wiki/Riemannian_geometry", "General topology": "/wiki/General_topology", "Algebraic topology": "/wiki/Algebraic_topology", "Geometric topology": "/wiki/Geometric_topology", "Differential topology": "/wiki/Differential_topology", "Mathematical modeling": "/wiki/Mathematical_modeling", "Dynamical systems": "/wiki/Dynamical_systems", "Control theory": "/wiki/Control_theory", "Calculus of variations": "/wiki/Calculus_of_variations", "Mathematical optimization": "/wiki/Mathematical_optimization", "Mathematical economics": "/wiki/Mathematical_economics", "Mathematical finance": "/wiki/Mathematical_finance", "Probability theory": "/wiki/Probability_theory", "Stochastic process": "/wiki/Stochastic_process", "Numerical analysis": "/wiki/Numerical_analysis", "Information theory": "/wiki/Information_theory", "Wikipedia:WikiProject Mathematics/List of mathematics articles (0–9)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematics_articles_(0%E2%80%939)", "Wikipedia:WikiProject Mathematics/List of mathematics articles (A)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematics_articles_(A)", "Wikipedia:WikiProject Mathematics/List of mathematics articles (B)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematics_articles_(B)", "Wikipedia:WikiProject Mathematics/List of mathematics articles (C)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematics_articles_(C)", "Wikipedia:WikiProject Mathematics/List of mathematics articles (D)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematics_articles_(D)", "Wikipedia:WikiProject Mathematics/List of mathematics articles (E)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematics_articles_(E)", "Wikipedia:WikiProject Mathematics/List of mathematics articles (F)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematics_articles_(F)", "Wikipedia:WikiProject Mathematics/List of mathematics articles (G)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematics_articles_(G)", "Wikipedia:WikiProject Mathematics/List of mathematics articles (H)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematics_articles_(H)", "Wikipedia:WikiProject Mathematics/List of mathematics articles (I)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematics_articles_(I)", "Wikipedia:WikiProject Mathematics/List of mathematics articles (J)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematics_articles_(J)", "Wikipedia:WikiProject Mathematics/List of mathematics articles (K)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematics_articles_(K)", "Wikipedia:WikiProject Mathematics/List of mathematics articles (L)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematics_articles_(L)", "Wikipedia:WikiProject Mathematics/List of mathematics articles (M)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematics_articles_(M)", "Wikipedia:WikiProject Mathematics/List of mathematics articles (N)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematics_articles_(N)", "Wikipedia:WikiProject Mathematics/List of mathematics articles (O)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematics_articles_(O)", "Wikipedia:WikiProject Mathematics/List of mathematics articles (P)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematics_articles_(P)", "Wikipedia:WikiProject Mathematics/List of mathematics articles (Q)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematics_articles_(Q)", "Wikipedia:WikiProject Mathematics/List of mathematics articles (R)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematics_articles_(R)", "Wikipedia:WikiProject Mathematics/List of mathematics articles (S)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematics_articles_(S)", "Wikipedia:WikiProject Mathematics/List of mathematics articles (T)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematics_articles_(T)", "Wikipedia:WikiProject Mathematics/List of mathematics articles (U)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematics_articles_(U)", "Wikipedia:WikiProject Mathematics/List of mathematics articles (V)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematics_articles_(V)", "Wikipedia:WikiProject Mathematics/List of mathematics articles (W)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematics_articles_(W)", "Wikipedia:WikiProject Mathematics/List of mathematics articles (X)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematics_articles_(X)", "Wikipedia:WikiProject Mathematics/List of mathematics articles (Y)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematics_articles_(Y)", "Wikipedia:WikiProject Mathematics/List of mathematics articles (Z)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematics_articles_(Z)", "Wikipedia:WikiProject Mathematics/List of mathematicians (A)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematicians_(A)", "Wikipedia:WikiProject Mathematics/List of mathematicians (B)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematicians_(B)", "Wikipedia:WikiProject Mathematics/List of mathematicians (C)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematicians_(C)", "Wikipedia:WikiProject Mathematics/List of mathematicians (D)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematicians_(D)", "Wikipedia:WikiProject Mathematics/List of mathematicians (E)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematicians_(E)", "Wikipedia:WikiProject Mathematics/List of mathematicians (F)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematicians_(F)", "Wikipedia:WikiProject Mathematics/List of mathematicians (G)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematicians_(G)", "Wikipedia:WikiProject Mathematics/List of mathematicians (H)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematicians_(H)", "Wikipedia:WikiProject Mathematics/List of mathematicians (I)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematicians_(I)", "Wikipedia:WikiProject Mathematics/List of mathematicians (J)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematicians_(J)", "Wikipedia:WikiProject Mathematics/List of mathematicians (K)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematicians_(K)", "Wikipedia:WikiProject Mathematics/List of mathematicians (L)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematicians_(L)", "Wikipedia:WikiProject Mathematics/List of mathematicians (M)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematicians_(M)", "Wikipedia:WikiProject Mathematics/List of mathematicians (N)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematicians_(N)", "Wikipedia:WikiProject Mathematics/List of mathematicians (O)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematicians_(O)", "Wikipedia:WikiProject Mathematics/List of mathematicians (P)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematicians_(P)", "Wikipedia:WikiProject Mathematics/List of mathematicians (Q)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematicians_(Q)", "Wikipedia:WikiProject Mathematics/List of mathematicians (R)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematicians_(R)", "Wikipedia:WikiProject Mathematics/List of mathematicians (S)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematicians_(S)", "Wikipedia:WikiProject Mathematics/List of mathematicians (T)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematicians_(T)", "Wikipedia:WikiProject Mathematics/List of mathematicians (U)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematicians_(U)", "Wikipedia:WikiProject Mathematics/List of mathematicians (V)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematicians_(V)", "Wikipedia:WikiProject Mathematics/List of mathematicians (W)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematicians_(W)", "Wikipedia:WikiProject Mathematics/List of mathematicians (X)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematicians_(X)", "Wikipedia:WikiProject Mathematics/List of mathematicians (Y)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematicians_(Y)", "Wikipedia:WikiProject Mathematics/List of mathematicians (Z)": "/wiki/Wikipedia:WikiProject_Mathematics/List_of_mathematicians_(Z)", "Portal:Arithmetic": "/wiki/Portal:Arithmetic", "Portal:Science": "/wiki/Portal:Science", "Portal:History of science": "/wiki/Portal:History_of_science", "Portal:Systems science": "/wiki/Portal:Systems_science", "Portal:Biology": "/wiki/Portal:Biology", "Portal:Chemistry": "/wiki/Portal:Chemistry", "Portal:Physics": "/wiki/Portal:Physics", "Portal:Earth sciences": "/wiki/Portal:Earth_sciences", "Portal:Technology": "/wiki/Portal:Technology", "WikiProjects": "/wiki/File:Society.svg", "Wikipedia:WikiProject Mathematics": "/wiki/Wikipedia:WikiProject_Mathematics", "Wikipedia talk:WikiProject Mathematics": "/wiki/Wikipedia_talk:WikiProject_Mathematics", "Wikipedia:WikiProject Mathematics/Participants": "/wiki/Wikipedia:WikiProject_Mathematics/Participants", "Wikipedia:WikiProject Mathematics/Current activity": "/wiki/Wikipedia:WikiProject_Mathematics/Current_activity", "Wikipedia:Manual of Style (mathematics)": "/wiki/Wikipedia:Manual_of_Style_(mathematics)", "Wikipedia:WikiProject Mathematics/Conventions": "/wiki/Wikipedia:WikiProject_Mathematics/Conventions", "Wikipedia:WikiProject Mathematics/Advice on using Wikipedia for mathematics self-study": "/wiki/Wikipedia:WikiProject_Mathematics/Advice_on_using_Wikipedia_for_mathematics_self-study", "Wikipedia:WikiProject Mathematics/Proofs": "/wiki/Wikipedia:WikiProject_Mathematics/Proofs", "Wikipedia:WikiProject Mathematics/PlanetMath Exchange": "/wiki/Wikipedia:WikiProject_Mathematics/PlanetMath_Exchange", "Wikipedia talk:WikiProject Mathematics/PlanetMath Exchange": "/wiki/Wikipedia_talk:WikiProject_Mathematics/PlanetMath_Exchange", "Wikipedia:WikiProject Mathematics/Graphics": "/wiki/Wikipedia:WikiProject_Mathematics/Graphics", "Wikipedia talk:WikiProject Mathematics/Graphics": "/wiki/Wikipedia_talk:WikiProject_Mathematics/Graphics", "Wikipedia:WikiProject Mathematics/Wikipedia 1.0": "/wiki/Wikipedia:WikiProject_Mathematics/Wikipedia_1.0", "Wikipedia talk:WikiProject Mathematics/Wikipedia 1.0": "/wiki/Wikipedia_talk:WikiProject_Mathematics/Wikipedia_1.0", "Wikipedia:WikiProject Computer science": "/wiki/Wikipedia:WikiProject_Computer_science", "Wikipedia:WikiProject Cryptography": "/wiki/Wikipedia:WikiProject_Cryptography", "Wikipedia:WikiProject Game theory": "/wiki/Wikipedia:WikiProject_Game_theory", "Wikipedia:WikiProject Numbers": "/wiki/Wikipedia:WikiProject_Numbers", "Wikipedia:WikiProject Physics": "/wiki/Wikipedia:WikiProject_Physics", "Wikipedia:WikiProject Science": "/wiki/Wikipedia:WikiProject_Science", "Wikipedia:WikiProject Statistics": "/wiki/Wikipedia:WikiProject_Statistics", "Wikipedia:Requested articles/Mathematics": "/wiki/Wikipedia:Requested_articles/Mathematics", "Category:Wikipedia requested images of mathematics": "/wiki/Category:Wikipedia_requested_images_of_mathematics", "Category:Mathematics articles needing expert attention": "/wiki/Category:Mathematics_articles_needing_expert_attention", "Wikimedia Foundation": "/wiki/Wikimedia_Foundation", "commons:Special:Search/Category:Mathematics": "https://commons.wikimedia.org/wiki/Special:Search/Category:Mathematics", "wikibooks:Special:Search/Mathematics": "https://en.wikibooks.org/wiki/Special:Search/Mathematics", "wikidata:Special:Search/Mathematics": "https://www.wikidata.org/wiki/Special:Search/Mathematics", "wikinews:Special:Search/Mathematics": "https://en.wikinews.org/wiki/Special:Search/Mathematics", "wikiquote:Special:Search/Mathematics": "https://en.wikiquote.org/wiki/Special:Search/Mathematics", "wikisource:Special:Search/Mathematics": "https://en.wikisource.org/wiki/Special:Search/Mathematics", "wikiversity:Special:Search/Mathematics": "https://en.wikiversity.org/wiki/Special:Search/Mathematics", "wiktionary:Special:Search/Mathematics": "https://en.wiktionary.org/wiki/Special:Search/Mathematics", "Wikipedia:Portal": "/wiki/Wikipedia:Portal", "List of all portals": "/wiki/Wikipedia:Contents/Portals", "The arts portal": "/wiki/Portal:The_arts", "Portal:The arts": "/wiki/Portal:The_arts", "Biography portal": "/wiki/Portal:Biography", "Portal:Biography": "/wiki/Portal:Biography", "Current events portal": "/wiki/Portal:Current_events", "Portal:Current events": "/wiki/Portal:Current_events", "Geography portal": "/wiki/Portal:Geography", "Portal:Geography": "/wiki/Portal:Geography", "History portal": "/wiki/Portal:History", "Portal:History": "/wiki/Portal:History", "Mathematics portal": "/wiki/Portal:Mathematics", "Science portal": "/wiki/Portal:Science", "Society portal": "/wiki/Portal:Society", "Portal:Society": "/wiki/Portal:Society", "Technology portal": "/wiki/Portal:Technology", "Random portal": "/wiki/Special:RandomInCategory/All_portals", "WikiProject Portals": "/wiki/Wikipedia:WikiProject_Portals"}